{
  "backend/main.mo": "Main Motoko canister managing ports and tugboats with CRUD methods and predefined Port of Tema data.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding tugboat storage and counters.",
  "feature_evidence.json": "Feature evidence report listing frontend feature implementations, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all major frontend files for reference.",
  "frontend/index.css": "Root Tailwind CSS configuration defining theme variables, dark mode, and global styling resets.",
  "frontend/index.html": "Base HTML entrypoint loading the React app root and main script with font preloads.",
  "frontend/src/App.tsx": "Sets up React Query, routing, theming, and role context, defining all app routes and layout.",
  "frontend/src/components/common/DetailDrawer.tsx": "Reusable drawer component displaying detailed entity information via a sheet interface.",
  "frontend/src/components/common/KpiCard.tsx": "Component rendering KPI cards with title, value, icon, and optional trend display.",
  "frontend/src/components/common/QueryState.tsx": "Provides loading skeletons, error displays, and empty states for data-fetching UI.",
  "frontend/src/components/common/StatusBadge.tsx": "Renders color-coded badges for various operational statuses across entity types.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level layout combining header, sidebar, and main routed content area.",
  "frontend/src/components/layout/HeaderBar.tsx": "Header bar showing logo, alerts, and a role selector that updates navigation based on role.",
  "frontend/src/components/layout/SideNav.tsx": "Role-based sidebar navigation that highlights the active route and renders icon-labeled nav items.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, handling login, logout, and stored identity restoration.",
  "frontend/src/index.css": "Tailwind setup defining a custom harbor-themed color system and utility classes for dark styling.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and Internet Identity provider.",
  "frontend/src/pages/assignments/AssignmentFormDialog.tsx": "Dialog for editing an assignment’s status with form controls and mutation handling.",
  "frontend/src/pages/assignments/AssignmentsPage.tsx": "Lists assignments with related vessel and resource info and provides creation and edit actions.",
  "frontend/src/pages/berthing/BerthDetailPanel.tsx": "Drawer panel displaying detailed information about a selected berthing point, including identification, location, specs, and operational notes.",
  "frontend/src/pages/berthing/BerthingPage.tsx": "Loads Port of Tema data and renders the berthing management overview with grouped infrastructure cards.",
  "frontend/src/pages/berthing/berthViewerModel.ts": "Defines berth scheduling model with size inference, vessel-type mapping, mock schedule generation, and filtering utilities.",
  "frontend/src/pages/berthing/InfrastructureGroupedCards.tsx": "Displays terminal, quay, and industrial infrastructure in grouped card grids with basic berth attributes.",
  "frontend/src/pages/berthing/PortOfTemaOverview.tsx": "Shows port metadata, infrastructure KPIs, and a table of dry docking stations with their specifications.",
  "frontend/src/pages/dashboards/BerthMasterDashboard.tsx": "Berth control dashboard showing berth utilization KPIs and a status table with vessel assignments.",
  "frontend/src/pages/dashboards/MaintenanceDashboard.tsx": "Displays tugboat health metrics by deriving health scores, showing KPIs, and listing equipment status with utilization.",
  "frontend/src/pages/dashboards/PortOpsDashboard.tsx": "Shows port operations KPIs, recent vessel arrivals, and active assignments with data from vessels, assignments, and alerts.",
  "frontend/src/pages/dashboards/TugDispatcherDashboard.tsx": "Provides dispatcher KPIs and detailed tugboat fleet and assignment status, including availability and active jobs.",
  "frontend/src/pages/tugboats/TugboatHealthDetail.tsx": "Detail drawer showing a tugboat’s computed health metrics across systems with progress indicators.",
  "frontend/src/pages/tugboats/TugboatsPage.tsx": "Lists all tugboats with key specs like bollard pull, engine power, and build year in a card grid.",
  "frontend/src/pages/vessels/VesselDetailPanel.tsx": "Detail drawer showing vessel info, current berth assignment, and assigned tugboats if applicable.",
  "frontend/src/pages/vessels/VesselsPage.tsx": "Renders the vessels management page with search, table listing, and detail panel using legacy vessel, berth, and assignment queries that currently return empty data.",
  "frontend/src/services/backendClient.ts": "Defines React Query keys and exposes a backend actor hook for accessing canister methods.",
  "frontend/src/services/mutations.ts": "Contains a deprecated mutation for updating assignment status that now always throws an error and triggers toast notifications.",
  "frontend/src/services/queries.ts": "Provides React Query hooks for legacy vessel, berth, assignment, and alert data (returning empty results) and functional hooks for tugboats and Port of Tema data.",
  "frontend/src/state/role.ts": "Defines role types, role configurations, and navigation items for different user roles.",
  "frontend/src/state/RoleProvider.tsx": "Implements a React context storing the user’s current role with persistence in localStorage.",
  "frontend/src/types/legacy.ts": "Declares stub legacy interfaces for vessels, berths, tugboats, assignments, and alerts.",
  "frontend/src/types/temaPort.ts": "Defines structured types for Port of Tema metadata, infrastructure, berthing points, dry docks, and grouped infrastructure.",
  "frontend/src/utils/berthSpecs.ts": "Utility functions for detecting unspecified berth specs, formatting values, and checking vessel–berth compatibility.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with theme extensions, color definitions, animations, and plugins.",
  "project_state.json": "Describes current project state, features, and requirements for implementing backend-stored tugboat data and displaying it as cards on the tugboats page."
}