{
  "backend/main.mo": "Stateful Motoko actor managing ports with CRUD-like operations, geolocation points, and seeded Port of Tema data.",
  "feature_evidence.json": "Feature evidence report linking a berthing-page UI update to impacted frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing routing, state, dashboards, and shared components.",
  "frontend/index.css": "Tailwind base styles defining theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Configures React Router routes, wraps the app in theme and role providers, and mounts dashboards/pages.",
  "frontend/src/components/common/DetailDrawer.tsx": "Reusable sheet-based drawer component for displaying detail panels.",
  "frontend/src/components/common/KpiCard.tsx": "KPI card component showing a metric with icon, value, and optional trend styling.",
  "frontend/src/components/common/QueryState.tsx": "Common loading skeleton, error state, and empty state components for data views.",
  "frontend/src/components/common/StatusBadge.tsx": "Status badge that normalizes status strings and renders variant-colored labels.",
  "frontend/src/components/layout/AppShell.tsx": "Root layout with header, side navigation, and main content outlet.",
  "frontend/src/components/layout/HeaderBar.tsx": "Header bar with logo, role selector, navigation, and urgency alert count.",
  "frontend/src/components/layout/SideNav.tsx": "Renders a role‑based sidebar navigation with dynamic icons and active link highlighting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind layers and custom Harbor theme color variables with utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/assignments/AssignmentFormDialog.tsx": "Dialog for editing assignment status using a form with controlled state and mutation handling.",
  "frontend/src/pages/assignments/AssignmentsPage.tsx": "Displays a table of assignments with related vessel/berth/tug data and supports create/edit actions.",
  "frontend/src/pages/berthing/BerthDetailPanel.tsx": "Detail drawer showing berth identification, location, specs, and operational info.",
  "frontend/src/pages/berthing/BerthingPage.tsx": "Berthing overview page loading port data and rendering grouped infrastructure cards.",
  "frontend/src/pages/berthing/berthViewerModel.ts": "Defines berth schedule/size logic and helper functions to augment and filter berthing points with mock occupancy data.",
  "frontend/src/pages/berthing/InfrastructureGroupedCards.tsx": "Renders grouped infrastructure cards for berths and facilities with draft, type, and location details.",
  "frontend/src/pages/berthing/PortOfTemaOverview.tsx": "Displays port metadata, infrastructure KPIs, and a table of dry‑docking stations.",
  "frontend/src/pages/dashboards/BerthMasterDashboard.tsx": "Dashboard showing berth KPIs and a table of berth occupancy with vessel assignments.",
  "frontend/src/pages/dashboards/MaintenanceDashboard.tsx": "Dashboard for tugboat health, showing operational KPIs and equipment status with utilization.",
  "frontend/src/pages/dashboards/PortOpsDashboard.tsx": "Displays KPIs and tables for vessels, assignments, and alerts, providing a real-time port operations overview.",
  "frontend/src/pages/dashboards/TugDispatcherDashboard.tsx": "Shows tugboat availability, assignments, and fleet status with KPIs and detailed tables for dispatcher control.",
  "frontend/src/pages/tugboats/TugboatHealthDetail.tsx": "Detail drawer presenting calculated health metrics and subsystem status for a selected tugboat.",
  "frontend/src/pages/tugboats/TugboatsPage.tsx": "Fleet overview table for all tugboats with assignment status and health, plus a detail drawer for health metrics.",
  "frontend/src/pages/vessels/VesselDetailPanel.tsx": "Detail drawer showing vessel specs, current berthing assignment, and assigned tugboats.",
  "frontend/src/pages/vessels/VesselsPage.tsx": "Vessel list with search, berth assignment display, and a detail panel for selected vessel information.",
  "frontend/src/services/backendClient.ts": "Defines react-query keys and exposes a hook to retrieve the backend actor.",
  "frontend/src/services/mutations.ts": "Contains a deprecated mutation hook for updating assignment status that now always errors.",
  "frontend/src/services/queries.ts": "Provides legacy query hooks returning empty data and Tema Port queries that fetch and transform port data.",
  "frontend/src/state/role.ts": "Defines role types and configuration objects including navigation and descriptions.",
  "frontend/src/state/RoleProvider.tsx": "Implements a React context for managing user roles with persistence in localStorage.",
  "frontend/src/types/legacy.ts": "Stub interfaces for legacy vessel, berth, tugboat, assignment, and alert types.",
  "frontend/src/types/temaPort.ts": "Type definitions for structured Port of Tema metadata, infrastructure, and grouped assets.",
  "frontend/src/utils/berthSpecs.ts": "Utility functions for detecting, formatting, and validating berth specification values.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, animations, and plugin setup.",
  "project_state.json": "Describes project state and feature requests related to replacing UI sections with infrastructure and tugboat card layouts."
}