{
  "backend/main.mo": "Motoko actor managing ports and tugboats with CRUD-like functions and auto-incrementing IDs, including helpers for geo points and warehouses.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Human-written summaries describing responsibilities of major frontend files, components, and pages.",
  "frontend/index.css": "Tailwind base/theme definitions with custom CSS variables for light and dark modes.",
  "frontend/index.html": "Base HTML document loading fonts and bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, query client provider, theme provider, and role provider for the app.",
  "frontend/src/components/common/DetailDrawer.tsx": "Reusable sheet-based drawer component for displaying entity details in a side panel.",
  "frontend/src/components/common/KpiCard.tsx": "KPI card component showing metric values, icons, and optional trend indicators with variant styling.",
  "frontend/src/components/common/QueryState.tsx": "Provides loading skeletons, error state, and empty state components for data-fetching views.",
  "frontend/src/components/common/StatusBadge.tsx": "Badge component that normalizes a status string and renders a color-coded variant based on type.",
  "frontend/src/components/common/VesselFinderAisMap.tsx": "Embeds a VesselFinder AIS map by injecting config and script tags once into a container div.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, side navigation, and routed content area.",
  "frontend/src/components/layout/HeaderBar.tsx": "Renders the top navigation bar showing logo, alert count, and a role selector that triggers navigation.",
  "frontend/src/components/layout/SideNav.tsx": "Generates a role‑based side navigation menu with icons and active‑route highlighting.",
  "frontend/src/data/temaFleet.ts": "Provides static structured data describing the Tema port tugboat fleet and vessel specifications.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling login, stored identities, and auth client setup.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom harbor‑themed color system with utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/assignments/AssignmentFormDialog.tsx": "Displays a dialog for updating an assignment's status using a controlled select and mutation hook.",
  "frontend/src/pages/assignments/AssignmentsPage.tsx": "Displays a list of assignments with vessel, berth, tugboat, and status details, and provides create/edit dialog functionality.",
  "frontend/src/pages/berthing/BerthDetailPanel.tsx": "Shows detailed information for a selected berth inside a drawer, including identification, location, specifications, and operational notes.",
  "frontend/src/pages/berthing/BerthingPage.tsx": "Fetches and displays Port of Tema data, rendering a grouped infrastructure view or appropriate loading/error states.",
  "frontend/src/pages/berthing/berthViewerModel.ts": "Defines types and helpers for augmenting berths with size, occupancy, and mock schedule data, plus filtering utilities.",
  "frontend/src/pages/berthing/InfrastructureGroupedCards.tsx": "Renders grouped infrastructure sections with cards showing berth and facility details for different port categories.",
  "frontend/src/pages/berthing/PortOfTemaOverview.tsx": "Displays port metadata, infrastructure KPIs, and a table of dry docking stations.",
  "frontend/src/pages/dashboards/BerthMasterDashboard.tsx": "Displays berth utilization, occupancy, and vessel assignments, with tables listing berth specs and current status. Includes KPI cards and loading/error handling.",
  "frontend/src/pages/dashboards/MaintenanceDashboard.tsx": "Shows tugboat health metrics derived from engine power, with KPIs and a detailed equipment health table. Computes operational status and utilization for each tug.",
  "frontend/src/pages/dashboards/PortOpsDashboard.tsx": "Provides port‑wide KPIs, recent vessel arrivals, active assignments, and urgent alerts. Integrates tables and AIS map components for operational visibility.",
  "frontend/src/pages/dashboards/TugDispatcherDashboard.tsx": "Manages tugboat availability and assignments, showing fleet status and active jobs. Displays KPIs and tables of tug status and assignment queues.",
  "frontend/src/pages/tugboats/TugboatHealthDetail.tsx": "Detail drawer showing calculated health metrics for a tugboat, including engine, hydraulic, and utilization scores. Uses progress bars and cards to present system health.",
  "frontend/src/pages/tugboats/TugboatList.tsx": "Displays a fleet header and grid of tugboat cards with key details and specifications.",
  "frontend/src/pages/tugboats/tugboatListTypes.ts": "Defines TypeScript interfaces for tugboat specifications, tugboat data, and fleet metadata.",
  "frontend/src/pages/tugboats/TugboatsPage.tsx": "Renders the tugboat fleet page and injects static Tema fleet data into TugboatList.",
  "frontend/src/pages/vessels/VesselDetailPanel.tsx": "Shows detailed vessel info, berth assignment, and assigned tugboats inside a drawer panel.",
  "frontend/src/pages/vessels/VesselsPage.tsx": "Lists vessels with search, table view, and a panel for viewing vessel details.",
  "frontend/src/services/backendClient.ts": "Defines query keys and exposes a hook to access the backend actor.",
  "frontend/src/services/mutations.ts": "Provides a legacy mutation hook for updating assignment status that now always errors.",
  "frontend/src/services/queries.ts": "Implements frontend data queries, with most returning empty arrays except those using the backend actor.",
  "frontend/src/state/role.ts": "Defines role types and configurations including navigation and descriptions.",
  "frontend/src/state/RoleProvider.tsx": "Provides role-based context with persistence and access hooks.",
  "frontend/src/types/legacy.ts": "Contains legacy stub types for vessels, berths, tugboats, assignments, and alerts.",
  "frontend/src/types/temaPort.ts": "Defines structured types for Port of Tema metadata, berths, docks, and grouped infrastructure.",
  "frontend/src/utils/berthSpecs.ts": "Helpers for detecting unspecified berth dimension values, formatting them, and checking vessel‑berth compatibility.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, fonts, animations, container settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing goals, features, and requirements for creating and integrating a reusable TugboatList component fed by Tema fleet JSON."
}