{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace Tugboats page main content with reusable Tema fleet JSON tugboat list",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a reusable TugboatList component that renders the full Tema fleet JSON metadata and all tugboat details with proper optional-field handling.",
      "acceptanceCriteria": [
        "A new reusable React component exists (e.g., under frontend/src/pages/tugboats or frontend/src/components) that takes Tema fleet JSON data and renders all 6 tugboats from the user-provided JSON.",
        "Each tugboat card/row shows: id, name, IMO number, year built, type, status, and a clearly labeled section for specifications and capabilities.",
        "Optional fields (e.g., engine_power_kw, last_maintenance) are rendered when present and omitted (without blank placeholders) when absent.",
        "User-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tugboats/TugboatList.tsx",
          "operation": "create",
          "description": "Create a reusable TugboatList React component that accepts the Tema fleet JSON object (including port/authority/fleet_last_updated and tugboats array) and renders: fleet header metadata plus a responsive list/grid of tugboats. Each tugboat item must show full details: id, name, IMO number, year built, type, specifications (bollard pull tonnes, gross tonnage, length, beam, max draught, and engine power when present), capabilities, status, and last_maintenance when present. Use existing shadcn-ui primitives (e.g., Card/Badge) only via imports (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/tugboats/tugboatListTypes.ts",
          "operation": "create",
          "description": "Add TypeScript types/interfaces for the static Tema fleet JSON shape used by TugboatList (fleet metadata + tugboats with optional fields) to ensure the component renders only fields present and omits absent optional data."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace only the Tugboats page <main> content (including the first paragraph) with the TugboatList output so no placeholder text remains.",
      "acceptanceCriteria": [
        "The Tugboats page no longer renders the previous fleet overview paragraph/content within the selected <main> area; it renders the TugboatList instead.",
        "All 6 tugboats from the provided JSON are visible on the Tugboats page with responsive layout (works on mobile and desktop without overflow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tugboats/TugboatsPage.tsx",
          "operation": "modify",
          "description": "Replace the existing TugboatsPage content rendering (including the current header/paragraph and backend-driven card grid) with a minimal wrapper that renders TugboatList using the static Tema fleet JSON module. Ensure this change only affects what renders inside the page content area (the selected <main> and its first paragraph), removing the old placeholder paragraph content from this page."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the Tugboats route uses the shared TugboatList component so tugboat fleet list markup is not duplicated and remains reusable for future tugboat-related pages.",
      "acceptanceCriteria": [
        "The /tugboats route uses the shared TugboatList component.",
        "No duplicated tugboat list rendering logic remains in TugboatsPage; it delegates to the shared component.",
        "If other tugboat-related pages need a fleet list in the future, the component can be imported and used without modification."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tugboats/TugboatsPage.tsx",
          "operation": "modify",
          "description": "Refactor TugboatsPage to delegate all fleet list rendering to the shared TugboatList component (no inline tugboat card/list mapping remains). Keep TugboatsPage as a thin composition layer that imports the shared component and the static fleet data."
        },
        {
          "path": "frontend/src/pages/tugboats/TugboatList.tsx",
          "operation": "modify",
          "description": "Structure TugboatList’s public API (props) to be page-agnostic (e.g., accept the fleet JSON object as input) so it can be imported by other tugboat-related pages without modification. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add the provided Tema fleet JSON as a static frontend data module and render tugboats from it (not from backend getAllTugboats), including fields not supported by current backend types.",
      "acceptanceCriteria": [
        "A static frontend data file/module contains the exact provided JSON structure/values.",
        "The TugboatList renders from this static data and shows fields that are not available in the current backend Tugboat type (e.g., IMO number, capabilities).",
        "No backend changes are required to display the tugboats from the provided JSON."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/temaFleet.ts",
          "operation": "create",
          "description": "Create a dedicated static frontend data module exporting the exact user-provided Tema fleet JSON object (port/authority/fleet_last_updated plus tugboats array with all provided fields/values). This module will be the single data source for TugboatList and must include fields not present in the backend Tugboat type (e.g., IMO number, capabilities, gross tonnage, beam, max draught)."
        },
        {
          "path": "frontend/src/pages/tugboats/TugboatsPage.tsx",
          "operation": "modify",
          "description": "Remove reliance on backend tugboat queries for this page by importing the static Tema fleet data module and passing it into TugboatList. Ensure the page renders purely from static data and does not call backend getAllTugboats for this view."
        }
      ]
    }
  ]
}