{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fetch backend tugboats and render card grid on Tugboats page",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a React Query hook that fetches tugboats from the backend actor on Tugboats page load and exposes loading/error/empty UI state.",
      "acceptanceCriteria": [
        "The tugboat query no longer returns a hard-coded empty array; it calls the backend actor method added in REQ-1.",
        "The query is enabled only when the backend actor is available (consistent with existing actor-gated queries).",
        "Loading and error states are displayed using existing QueryState components (LoadingSkeleton/ErrorState), and an empty state is shown when the list is empty."
      ],
      "file_operations": [
        {
          "path": "frontend/src/services/queries.ts",
          "operation": "modify",
          "description": "Update the tugboat query hook to call the backend actor’s getAllTugboats when the actor is available (actor-gated enabled flag consistent with existing Port of Tema queries). Switch the hook’s Tugboat type to the generated backend type (from the existing backend TypeScript declarations) so the Tugboats page can render backend-provided fields."
        },
        {
          "path": "frontend/src/pages/tugboats/TugboatsPage.tsx",
          "operation": "modify",
          "description": "Wire the updated useTugboats hook into the page-level UI state: show LoadingSkeleton while loading, ErrorState on error, and EmptyState when the returned list is empty. Verify the component's usage instructions before implementing (LoadingSkeleton/ErrorState/EmptyState are from the existing QueryState module)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace the selected Tugboats page content area with a responsive card grid that displays only the fetched tugboats.",
      "acceptanceCriteria": [
        "The selected content area no longer renders the current header/table/health-drawer content; it renders only tugboat cards.",
        "Each tugboat is displayed as a Card showing at minimum: ID, Name, Built (year), Bollard pull, Type.",
        "Cards are laid out responsively (e.g., 1 column on small screens, 2–3 columns on larger screens) with consistent spacing.",
        "All user-facing text in this new card area is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tugboats/TugboatsPage.tsx",
          "operation": "modify",
          "description": "Within the existing page container that corresponds to the selected XPath content area, remove the current header/table/health-drawer rendering and replace it with a responsive grid of shadcn-ui Card components, one per tugboat, displaying: ID, Name, Built (year), Bollard pull, and Type. Ensure this area renders nothing else besides the cards (plus the required loading/error/empty states). Verify the component's usage instructions before implementing (use shadcn-ui Card for the card layout)."
        }
      ]
    }
  ]
}