{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Project to display a tugboat list as cards on a tugboat page, with data stored in a backend canister (Motoko type) and dynamically fetched on each page load; selected element content is fully replaced by these cards.",
  "architectural_notes": [
    "Store tugboats in backend canister as a dedicated Motoko Tugboat record type and collection.",
    "Frontend fetches tugboat list from backend canister on every page load (dynamic, not static).",
    "Tugboat page selected element should replace all existing content with tugboat cards UI."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-frontend-implement-a-react-query-hook-to-fetch-the-tugboat-list-from-the-backend-canister-on-each-tugboats-page-load-and-wire-it-to-the-tugboats-page-ui-state-loading-error-empty",
      "title": "Frontend: Implement a React Query hook to fetch the tugboat list from the backend canister on each Tugboats page load, and wire it to the Tugboats page UI state (loading/error/empty).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-frontend-selected-element-only-on-the-tugboats-page-replace-the-existing-content-rendered-inside-the-selected-element-at-xpath-html-1-body-1-div-1-div-1-div-1-main-1-div-1-div-1-with-a-card-based-layout-that-displays-the-fetched-tugboats-and-nothing-else-as-individual-cards",
      "title": "Frontend (selected element only): On the Tugboats page, replace the existing content rendered inside the selected element at XPath /html[1]/body[1]/div[1]/div[1]/div[1]/main[1]/div[1]/div[1] with a card-based layout that displays the fetched tugboats (and nothing else) as individual cards.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add tugboat data model in Motoko backend canister and dynamically fetch/display tugboats as cards on tugboat page, replacing selected element’s existing content",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Backend: Add a dedicated Motoko Tugboat data model and store the provided 6 tugboats in the backend canister so they can be fetched dynamically by the frontend.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Add backend-stored tugboat list and display as cards on Tugboats page",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}